import {memo} from "react";

export const UserComponent = memo(() => {//За допомогою функції memo-React запамятовує результат виконання всієї функції,не буде рендеритись,якщо не буде змінюватись,тобто не будуть всередину приходити ніякі пропси
    console.log('user');//з функцією memo,якщо немає данних,які змінюються(наприклад props),то функція виконується лише раз,тому в консолі ми бачимо лише один раз 'user'.
    return (
        <div>user</div>//цей javascript обєкт зберігається у кеші і використовується знову без запуску функції
    );
});