import {UserComponent} from "./UserComponent.tsx";
import {useEffect, useState} from "react";

export const UsersComponent = () => {
    console.log('users');//в консолі буде 2 рази написано 'users',бо спочатку початкове значення юзерів пустий масив,а коли оновляться данні компонента перемалюється заново
    const [users, setUsers] = useState([]);//створила локальну змінну і деструктиризувала(отримала гетер і сеттер),щоб реакт запамятав данні між перемальовками
    useEffect(() => {//
        fetch('https://jsonplaceholder.typicode.com/users')//функція для відправки запитів на сервер,повертає проміс
            .then(value => value.json())//коли нарешті прийде відповідь від сервера я отримую response,це обєкт в якому,данні боді в байтах і треба перетворити їх в json структуру.Так,як .json() також асинхронний-він повертає проміс і автоматично повертає отриману інформацію у форматі json  в наступний then.
            .then(value => {//value — це результат виконання value.json(),яке я ретьорнула з обробника then
                setUsers(value);//коли данні прийшли,ми оновлюємо стан.Це тригер для реакт,який змушує знову виконати функцію UsersComponent
            });

        return () => {
            console.log('unsubscribe');
        }
    }, []);//масив залежностей,якщо його немає,то функція буде запускатись кожного рендера,тобто,якщо я тут його заберу,то 1 рендер все відмалювалось,далі спрацьовує юзефект і в ньому я переписую стейт,стейт змінився-то треба зробити знову рендер,перемальовка відбулась і знову викликаю юзефект  і так безкінечно
    return (
        <div>users component
            <UserComponent/>
        </div>
    );
};